[
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/node/200",
        "qn": "How do I replace my previously Manual Certificate of Residence for Life and Citizenship (Digitisation)? ",
        "ans": "All registered and naturalized citizens with manual certificates applying for e-passports must first submit their information online to undergo the digitization process as follows: The same process applies to applicants who hold manual certificates of Residence for life"
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/node/199",
        "qn": "Is Uganda still issuing visas on arrival?",
        "ans": "Applicants are strongly encouraged to submit their visa applications online at www.visas.immigration.go.ug to enable proper processing of their applications and avoid any inconveniences"
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/node/198",
        "qn": "How do I apply for a visa to Uganda?",
        "ans": "All persons intending to travel to Uganda for holiday, tourism, business, study, visit, and/or medical are required to apply and obtain a visa online."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/another-application-exists",
        "qn": "When I submit an application, I get a message that another application already exists",
        "ans": "If you are receiving an error message that says \"Cannot apply twice with the same passport for the same visa or permit type (same passport number, same document type and same issuing country)\" it is because you already have a pending application on the system."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/forgot-application-id",
        "qn": "What if I forgot my application Id?",
        "ans": "For retrieving the application Id please click \"here\"."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/trouble-submitting-application",
        "qn": "I am having technical difficulties submitting my application",
        "ans": "There are a number of things that could be causing you problems. Please ensure that your computer meets the minimum configuration requirements."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/software-submit-application",
        "qn": "Do I need any specific software to submit an application?",
        "ans": "Only an internet browser is required. All major browsers are supported. Please verify the release of the browser is the most up to date."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/visa-extension",
        "qn": "How do I extend my visa or permit?",
        "ans": "Extending your current valid visa or permit can be done through \"Extend your application\" under \"Applications\" from the global navigation menu. For extending a visa or permit applied using the Uganda Electronic Visa/Permit web site you should provide the application Id of the visa or permit to extend, the passport number used for the visa or permit to extend and the date of birth."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/permit-extension",
        "qn": "How do I replace my permit?",
        "ans": "Replacing a permit can be done only if the permit was applied using the Uganda Electronic Visa/Permit web site. It can be done through \"Replace your application\" under \"Applications\" from the global navigation menu. For replacing a permit, it is mandatory to provide the application Id of the permit to replace, the passport number used for the permit to replace and the date of birth."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/printed-copy-visa",
        "qn": "Do I need to bring a printout or digital copy of my visa aproval letter to the point of entry?",
        "ans": "It is not mandatory but it is recommended. The barcode present in the approval letter will be used for accessing your application at the point of entry so bringing it printed will speed up the final approval process done."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/pay-online",
        "qn": "Can I pay my application online?",
        "ans": "Yes all the application types can be paid online. Note that all Visa applications are online."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/printed-copy-permit",
        "qn": "Do I need to bring a printout or digital copy of my permit aproval letter to the Immigration Office?",
        "ans": "It is not mandatory but it is recommended. The barcode present in the approval letter will be used for accessing your application at the Immigration Office so bringing it printed will speed up the final approval process done."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/reapply-after-rejection",
        "qn": "Can I reapply if my application was rejected?",
        "ans": "If your application is rejected, you have 48 hours to leave the country however you are granted 30 days to either submit your application for review by the board or apply for appeal."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/reason-cancellation",
        "qn": "Can I find out the reason my application was rejected?",
        "ans": "Whenever an application is rejected the reasons will be informed in the email sent or in the information provided through \"Manage your application\" under \"Applications\" from the global navigation menu."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/cancel-application",
        "qn": "Can I cancel my application?",
        "ans": "You can cancel your application at any moment however the fee paid (if any) will not be refunded."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/modify-application",
        "qn": "Can I modify my application?",
        "ans": "Once your application is submitted and the approval is in progress, your application cannot be modified unless additional information is requested by the Immigration Officer that is studying it."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/pay-application",
        "qn": "How I can pay for my application after submission?",
        "ans": "You can pay your application through the Uganda electronic Visa/Permit web site in \"Manage your application\" under \"Applications\" from the global navigation menu."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/check-application-status",
        "qn": "How can I check my application status?",
        "ans": "Any change in the status of your application will be sent to the email specified during the application process. These communications can be also checked through the Uganda Electronic Visa/Permit web site in \"Manage your application\" under \"Applications\" from the global navigation menu."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/admission-uganda",
        "qn": "If approved, does this guarantee my admission to Uganda?",
        "ans": "As explained in What is the difference between the approval letter and the visa or permit? the final approval is done at the selected point of entry (in the case of a visa) or at the Immigration Office."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/other-payment-modes",
        "qn": "Do you only accept credit cards?",
        "ans": "All the online payments must be made by credit card/debit card at this time. The eVisa system currently accepts only the following credit card/debit cards: MasterCard and Visa."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/credit-card-safety",
        "qn": "Is my credit card information safe?",
        "ans": "Yes. The eVisa system does not retain your credit card information after the transaction is processed."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/online-fee",
        "qn": "Is there a fee to pay online?",
        "ans": "Yes, there is a fee associated with all the online payments. A 3% of the application fee will be added to your payment method."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/mandatory-online-payment",
        "qn": "What does \"mandatory online payment\" mean?",
        "ans": "If the application has the online payment as mandatory, this means that the application will not be submitted for processing until all payment information is received. The applications not paid will be cancelled automatically."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/approval-letter-vs-visa",
        "qn": "What is the difference between the approval letter and the visa or permit?",
        "ans": "The approval letter sent by email or downloaded through the Uganda Electronic Visa/Permit web site establishes that you are eligible for the approved visa or permit, but does not establish that your applicant is definitely approved.\n\nThis final approval will be done at the selected point of entry (in the case of a visa) or at the Immigration Office Headquarters where the visa or permit sticker will be printed and it will be pasted to the passport."
    },
    {
        "topic": "Immigration Control",
        "link": "https://www.immigration.go.ug/faqs/visa-exempt",
        "qn": "Which nationalities are visa exempt?",
        "ans": "If your nationality is one of the list, you don't need to apply for a Visa for entering in Uganda:"
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/node/202",
        "qn": "Can the dual citizenship card or certificate be issued on the same day the applicant submits his biometrics",
        "ans": "Yes it can"
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/node/201",
        "qn": "How long the dual citizenship approval remain valid in case the applicant does not travel to Uganda to have his biometrics taken and certificate issued.",
        "ans": "It remains valid until the applicant gets it endorsed (has their biometrics taken) and receives their certificate"
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/node/196",
        "qn": "How should I make payments for the passport fees",
        "ans": "Passport fees can be paid by credit card, online or at the banks"
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/node/195",
        "qn": "When will new e-passports be issued at the missions like before?",
        "ans": "It is a new system that is gradually being rolled out to the other Missions / Immigration stations and is currently only available at the Immigration Head Office in Kampala"
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/faqs/dual-citizenship-below-18-years",
        "qn": "Why don't children below 18 years born of Ugandans in Diaspora not eligible for dual citizenship of Uganda??",
        "ans": "The law does not allow Children below 18 years to acquire dual citizenship."
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/faqs/ugandan-invitation-letter-visa",
        "qn": "If I am a Ugandan and obtained a foreign passport, why then need an invitation letter while applying for a Ugandan visa?",
        "ans": "It is to enable authorities to properly document your visit"
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/faqs/first-time-applicant-missions",
        "qn": "Is it possible for someone to obtain a passport for the first time from the Mission?",
        "ans": "Missions only handle renewal, replacements and new passports for the children of Ugandans in the diaspora. "
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/faqs/phase-out-machine-readable-passports",
        "qn": "When are the Machine-readable passports going to be phased out?",
        "ans": "Ugandan machine-readable passports will no longer be valid for international travel after April 4, 2022, and will be replaced by international East African e-passports."
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/faqs/costly-dual-citizenship-ticket",
        "qn": "It is very costly to apply for the Dual citizenship online and then buy a ticket to travel to Uganda just for the certificate.",
        "ans": "Dual Citizenship for Indigenous Ugandans is 200USD, down from 400USD previously."
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/faqs/dual-citizenship-biometric-certificate",
        "qn": "Why aren't Dual citizenship Biometric certificate is not issued at the Mission?",
        "ans": "It is a new system that is gradually being rolled out to the other Immigration Stations and is currently only available at the Immigration Head Office in Kampala"
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/faqs/minors-dual-citizenship",
        "qn": "Can minors get Ugandan passport as well as foreign passport and if i do not declare my child's other passport what happens?",
        "ans": "A minor is ineligible for Dual Citizenship until they are 18 years of age. Failure to declare the other passport will lead to confiscation of the Ugandan Passport and/or prosecution "
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/faqs/priniting-to-embassy",
        "qn": "If passport application is online, why can't I just submit my application online instead printing the application and submitting it at the embassy?",
        "ans": "Applicants submit their applications personally to the embassy for verification of the applicant"
    },
    {
        "topic": "Citizenship and Passport Control",
        "link": "https://www.immigration.go.ug/faqs/passport-process-duration",
        "qn": "How long can my passport be processed?",
        "ans": "It takes 10 working days to process a passport with the regular fees, Ugx 250,000 and 2 working days for the Express Process at Ugx 400,000. This is after enrollment process is complete."
    }
]